1. Создать репозиторий на GitHub
2. Нарисовать блок схему алгоритма
3. Снабдить репозиторий оформленным текстовым описанием (файл Readмe.md)
4. Написать программу, решающую поставленную задачу
5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так что все залито одним коммитом, как минимум этап 2, 3 и 4 должны быть расположены в разных коммитах)
 
 void GetRead(string[] arr) // метод сортировки

{
   
    string[] sortarray = new string[arr.Length]; задан новый массив с длиной, равной длине входящего массива
    
    for(int i = 0; i < arr.Length; i++) // перебирает элементы, пока индекс меньше длины массива
    
    if(arr[i].Length <=3 ) // если длина элемента i входящего массива <= 3
    
    { 
     
     sortarray[i] = arr[i];  // элемент i помещается в sortarray[i] 
    
     Console.Write($"{sortarray[i]}, "); // вывод на экран
    
    }
}

string[] array = new string[] {"25", "gun", "food", "town", "1", "stop"}; // задан массив строк

GetRead(array); // применение метода к массиву
